zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hvms128k.svd
        <register>
          <name>LIN_BIST</name>
          <description>LIN BIST Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x37</resetMask>
          <fields>
            <field>
              <name>LIN_ADFT</name>
              <description>Enables Test Modes</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Operation (DFT disabled), amuxbus_a=Z, dft&lt;1:0&gt;=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_MONITOR_LWAVE</name>
                  <description>amuxbus_a=Iwave (PMOS drain), dft&lt;1:0&gt;=0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLTAGE_MONITOR_ERRBUFF</name>
                  <description>amuxbus_a=ErrBuff, dft&lt;1:0&gt;=0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEAK_OUTFET</name>
                  <description>OUTFET = 1/10,  (amuxbus_a=Z, dft&lt;1:0&gt;=0)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_MONITOR_FOR_BIAS_CKT</name>
                  <description>amuxbus_a=Ibias monitor (PMOS drain), dft&lt;1:0&gt;=0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SL_ROUND</name>
                  <description>0=Normal, 1=More moderate (rounded) edge for lower EMI</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDFT_OSC</name>
                  <description>amuxbus_a = Z
dft&lt;1&gt; = LIN_DFT_START,  dft&lt;0&gt; = LIN_OSC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDFT_DELAY</name>
                  <description>amuxbus_a = Z
dft&lt;1&gt; = LIN_DFT_START,  dft&lt;0&gt; = LIN_DELAY</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIN_DDFT</name>
              <description>Enable LIN DDFT outputs to DDFT interface
ddft1 = dft&lt;1&gt;, ddft0 = dft&lt;0&gt;</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LIN_DFT_START</name>
              <description>Delay line input</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR</name>
          <description>HVSS Interrupt Request Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Master asserted dominant state wakeup (wakeup timer timeout)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Interface asserted state for too long (dominant state timeout)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HVREG_TSD</name>
              <description>Thermal Shutdown Detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_SET</name>
          <description>HVSS Interrupt set register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HVREG_TSD</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_MASK</name>
          <description>HVSS Interrupt mask register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HVREG_TSD</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_MASKED</name>
          <description>HVSS Interrupt masked register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HVREG_TSD</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVSS_DDFT</name>
          <description>HVSS DDFT Control</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LSOUT_DDFT</name>
              <description>Enable LSOUT DDFT output to DDFT interface
ddft1 = lsout_ddft, ddft0 = 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM</name>
          <description>HVREG Master Trim (Output Voltage)</description>
          <addressOffset>0xFF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Trim for VDDD output.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_TRIM</name>
          <description>LIN Trim Settings</description>
          <addressOffset>0xFF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SLEW_CTL</name>
              <description>N/A</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM_VREF</name>
          <description>HVREG Vref Trim</description>
          <addressOffset>0xFF10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>VREF_CTL</name>
              <description>Vref Trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM_VREF_TC</name>
          <description>HVREG Vref Output Voltage temp-co Trim</description>
          <addressOffset>0xFF14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>TC_CTL</name>
              <description>Vref Temperature Trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM_TSD</name>
          <description>HVREG TSD detection temperatureTrim</description>
          <addressOffset>0xFF18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>TSD_CTL</name>
              <description>TSD Trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM_S</name>
          <description>HVREG Slave Trim (Output Voltage)</description>
          <addressOffset>0xFF1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Trim for VDDD output.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
