zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hvms128k.svd
          <register>
            <name>INTR_MASKED</name>
            <description>Interrupt masked</description>
            <addressOffset>0xCC</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFC3F1B</resetMask>
            <fields>
              <field>
                <name>TX_HEADER_DONE</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_RESPONSE_DONE</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_WAKEUP_DONE</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_TRIGGER</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_HEADER_DONE</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_RESPONSE_DONE</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_WAKEUP_DETECT</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_TRIGGER</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_HEADER_PID_DONE</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TXRX_COMPLETE</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[13:13]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TIMEOUT</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_HEADER_ARB_LOST</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_BIT_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[20:20]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_CRC_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[21:21]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_HEADER_PARITY_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[22:22]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_DATA_LENGTH_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[23:23]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_DATA_LENGTH_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[24:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_OVERFLOW_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[25:25]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_OVERFLOW_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[26:26]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_UNDERFLOW_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[27:27]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_UNDERFLOW_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FRAME_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[29:29]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FRAME_ERROR</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
