zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hvms128k.svd
        <register>
          <name>MUX_SWITCH_CLEAR2</name>
          <description>EXPMUX and DIAGMUX Firmware switch control clear</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_FW_EXP_P0_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P1_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P2_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P3_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P4_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P5_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P6_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P7_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P0_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P1_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P2_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P3_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P4_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P5_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P6_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_EXP_P7_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD0_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD1_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD2_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD3_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD4_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD5_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD6_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD7_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VG0_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VG1_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VG2_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VG3_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_CSRC_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_CSINK_VPLUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_CSRC_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_CSINK_VMINUS</name>
              <description>Write '1' to clear corresponding bit in MUX_SWITCH2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_SWITCH_HW_CTRL</name>
          <description>SARMUX switch hardware control</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xCF00FF</resetMask>
          <fields>
            <field>
              <name>MUX_HW_CTRL_P0</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P0 switches.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_P1</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P1 switches.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_P2</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P2 switches.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_P3</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P3 switches.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_P4</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P4 switches.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_P5</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P5 switches.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_P6</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P6 switches.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_P7</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P7 switches.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_VSSA</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for vssa switch.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_TEMP</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for temp switch.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_AMUXBUSA</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for amuxbusa switches.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_AMUXBUSB</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for amuxbusb switches.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_SARBUS0</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for sarbus0 switches.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_SARBUS1</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for sarbus1 switches.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_SWITCH_HW_CTRL2</name>
          <description>EXPMUX and DIAGMUX switch hardware control</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0FF00FF</resetMask>
          <fields>
            <field>
              <name>MUX_HW_CTRL_EXP_P0</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P0 switches.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_EXP_P1</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P1 switches.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_EXP_P2</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P2 switches.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_EXP_P3</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P3 switches.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_EXP_P4</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P4 switches.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_EXP_P5</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P5 switches.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_EXP_P6</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P6 switches.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_HW_CTRL_EXP_P7</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for pin P7 switches.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD0_VG0</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for Vdiag.0 and Vgnd.0 switches</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD1_VG1</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for Vdiag.1 and Vgnd.1 switches</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD2_VG2</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for Vdiag.2 and Vgnd.2 switches</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD3_VG3</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for Vdiag.3 and Vgnd.3 switches</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD4</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for Vdiag.4 switch.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD5</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for Vdiag.5 switch.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD6</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for Vdiag.6 switch.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_VD7</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for Vdiag.7 switch.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_CSRC_VPLUS</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting to close switch between 10uA current source and the vplus signal.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_CSINK_VPLUS</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for close switch between 10uA current sink and the vplus signal.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_CSRC_VMINUS</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting for close switch between 10uA current source and the vminus signal.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX_FW_CSINK_VMINUS</name>
              <description>Hardware control: 0=only firmware control, 1=hardware control masked by firmware setting to close switch between 10uA current sink and the vminus signal.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
